OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f785.h
extern __at(0x009F) volatile __ADCON1bits_t ADCON1bits;

#define _ADCS0                  0x10
#define _ADCS1                  0x20
#define _ADCS2                  0x40

//==============================================================================


//==============================================================================
//        PWMCON1 Bits

extern __at(0x0110) __sfr PWMCON1;

typedef union
  {
  struct
    {
    unsigned CMDLY0             : 1;
    unsigned CMDLY1             : 1;
    unsigned CMDLY2             : 1;
    unsigned CMDLY3             : 1;
    unsigned CMDLY4             : 1;
    unsigned COMOD0             : 1;
    unsigned COMOD1             : 1;
    unsigned OVRLP              : 1;
    };

  struct
    {
    unsigned CMDLY              : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned COMOD              : 2;
    unsigned                    : 1;
    };
  } __PWMCON1bits_t;

extern __at(0x0110) volatile __PWMCON1bits_t PWMCON1bits;

#define _CMDLY0                 0x01
#define _CMDLY1                 0x02
#define _CMDLY2                 0x04
#define _CMDLY3                 0x08
#define _CMDLY4                 0x10
#define _COMOD0                 0x20
#define _COMOD1                 0x40
#define _OVRLP                  0x80

//==============================================================================


//==============================================================================
//        PWMCON0 Bits

extern __at(0x0111) __sfr PWMCON0;

typedef union
  {
  struct
    {
    unsigned PH1EN              : 1;
    unsigned PH2EN              : 1;
    unsigned SYNC0              : 1;
    unsigned SYNC1              : 1;
    unsigned BLANK1             : 1;
    unsigned BLANK2             : 1;
    unsigned PASEN              : 1;
    unsigned PRSEN              : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned SYNC               : 2;
    unsigned                    : 4;
    };
  } __PWMCON0bits_t;

extern __at(0x0111) volatile __PWMCON0bits_t PWMCON0bits;

#define _PH1EN                  0x01
#define _PH2EN                  0x02
#define _SYNC0                  0x04
#define _SYNC1                  0x08
#define _BLANK1                 0x10
#define _BLANK2                 0x20
#define _PASEN                  0x40
#define _PRSEN                  0x80

//==============================================================================


//==============================================================================
//        PWMCLK Bits

extern __at(0x0112) __sfr PWMCLK;

typedef union
  {
  struct
    {
    unsigned PER0               : 1;
    unsigned PER1               : 1;
    unsigned PER2               : 1;
    unsigned PER3               : 1;
    unsigned PER4               : 1;
    unsigned PWMP0              : 1;
    unsigned PWMP1              : 1;
    unsigned PWMASE             : 1;
    };

  struct
    {
    unsigned PER                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned                    : 5;
    unsigned PWMP               : 2;
    unsigned                    : 1;
    };
  } __PWMCLKbits_t;

extern __at(0x0112) volatile __PWMCLKbits_t PWMCLKbits;

#define _PER0                   0x01
#define _PER1                   0x02
#define _PER2                   0x04
#define _PER3                   0x08
#define _PER4                   0x10
#define _PWMP0                  0x20
#define _PWMP1                  0x40
#define _PWMASE                 0x80

//==============================================================================


//==============================================================================
//        PWMPH1 Bits

extern __at(0x0113) __sfr PWMPH1;

typedef union
  {
  struct
    {
    unsigned PH0                : 1;
    unsigned PH1                : 1;
    unsigned PH2                : 1;
    unsigned PH3                : 1;
    unsigned PH4                : 1;
    unsigned C1EN               : 1;
    unsigned C2EN               : 1;
    unsigned POL                : 1;
    };

  struct
    {
    unsigned PH                 : 5;
    unsigned                    : 3;
    };
  } __PWMPH1bits_t;

extern __at(0x0113) volatile __PWMPH1bits_t PWMPH1bits;

#define _PH0                    0x01
#define _PH1                    0x02
#define _PH2                    0x04
#define _PH3                    0x08
#define _PH4                    0x10
#define _C1EN                   0x20
#define _C2EN                   0x40
#define _POL                    0x80

//==============================================================================


//==============================================================================
//        PWMPH2 Bits

extern __at(0x0114) __sfr PWMPH2;

typedef union
  {
  struct
    {
    unsigned PH0                : 1;
    unsigned PH1                : 1;
    unsigned PH2                : 1;
    unsigned PH3                : 1;
    unsigned PH4                : 1;
    unsigned C1EN               : 1;
    unsigned C2EN               : 1;
    unsigned POL                : 1;
    };

  struct
    {
    unsigned PH                 : 5;
    unsigned                    : 3;
    };
  } __PWMPH2bits_t;

extern __at(0x0114) volatile __PWMPH2bits_t PWMPH2bits;

#define _PWMPH2_PH0             0x01
#define _PWMPH2_PH1             0x02
#define _PWMPH2_PH2             0x04
#define _PWMPH2_PH3             0x08
#define _PWMPH2_PH4             0x10
#define _PWMPH2_C1EN            0x20
#define _PWMPH2_C2EN            0x40
#define _PWMPH2_POL             0x80

//==============================================================================


//==============================================================================
//        CM1CON0 Bits

extern __at(0x0119) __sfr CM1CON0;

typedef union
  {
  struct
    {
    unsigned C1CH0              : 1;
    unsigned C1CH1              : 1;
    unsigned C1R                : 1;
    unsigned C1SP               : 1;
    unsigned C1POL              : 1;
    unsigned C1OE               : 1;
    unsigned C1OUT              : 1;
    unsigned C1ON               : 1;
    };

  struct
    {
    unsigned C1CH               : 2;
    unsigned                    : 6;
    };
  } __CM1CON0bits_t;

extern __at(0x0119) volatile __CM1CON0bits_t CM1CON0bits;

#define _C1CH0                  0x01
#define _C1CH1                  0x02
#define _C1R                    0x04
#define _C1SP                   0x08
#define _C1POL                  0x10
#define _C1OE                   0x20
#define _C1OUT                  0x40
#define _C1ON                   0x80

//==============================================================================


//==============================================================================
//        CM2CON0 Bits

extern __at(0x011A) __sfr CM2CON0;

typedef union
  {
  struct
    {
    unsigned C2CH0              : 1;
    unsigned C2CH1              : 1;
    unsigned C2R                : 1;
    unsigned C2SP               : 1;
    unsigned C2POL              : 1;
    unsigned C2OE               : 1;
    unsigned C2OUT              : 1;
    unsigned C2ON               : 1;
    };

  struct
    {
    unsigned C2CH               : 2;
    unsigned                    : 6;
    };
  } __CM2CON0bits_t;

