OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f785.h
#define SCS                     OSCCONbits.SCS                  // bit 0
#define LTS                     OSCCONbits.LTS                  // bit 1
#define HTS                     OSCCONbits.HTS                  // bit 2
#define OSTS                    OSCCONbits.OSTS                 // bit 3
#define IRCF0                   OSCCONbits.IRCF0                // bit 4
#define IRCF1                   OSCCONbits.IRCF1                // bit 5
#define IRCF2                   OSCCONbits.IRCF2                // bit 6

#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0, shadows bit in PCONbits
#define NOT_BOD                 PCONbits.NOT_BOD                // bit 0, shadows bit in PCONbits
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define SBOREN                  PCONbits.SBOREN                 // bit 4, shadows bit in PCONbits
#define SBODEN                  PCONbits.SBODEN                 // bit 4, shadows bit in PCONbits

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0, shadows bit in PIE1bits
#define T1IE                    PIE1bits.T1IE                   // bit 0, shadows bit in PIE1bits
#define TMR2IE                  PIE1bits.TMR2IE                 // bit 1, shadows bit in PIE1bits
#define T2IE                    PIE1bits.T2IE                   // bit 1, shadows bit in PIE1bits
#define OSFIE                   PIE1bits.OSFIE                  // bit 2
#define C1IE                    PIE1bits.C1IE                   // bit 3
#define C2IE                    PIE1bits.C2IE                   // bit 4
#define CCP1IE                  PIE1bits.CCP1IE                 // bit 5
#define ADIE                    PIE1bits.ADIE                   // bit 6
#define EEIE                    PIE1bits.EEIE                   // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0, shadows bit in PIR1bits
#define T1IF                    PIR1bits.T1IF                   // bit 0, shadows bit in PIR1bits
#define TMR2IF                  PIR1bits.TMR2IF                 // bit 1, shadows bit in PIR1bits
#define T2IF                    PIR1bits.T2IF                   // bit 1, shadows bit in PIR1bits
#define OSFIF                   PIR1bits.OSFIF                  // bit 2
#define C1IF                    PIR1bits.C1IF                   // bit 3
#define C2IF                    PIR1bits.C2IF                   // bit 4
#define CCP1IF                  PIR1bits.CCP1IF                 // bit 5
#define ADIF                    PIR1bits.ADIF                   // bit 6
#define EEIF                    PIR1bits.EEIF                   // bit 7

#define RA0                     PORTAbits.RA0                   // bit 0
#define RA1                     PORTAbits.RA1                   // bit 1
#define RA2                     PORTAbits.RA2                   // bit 2
#define RA3                     PORTAbits.RA3                   // bit 3
#define RA4                     PORTAbits.RA4                   // bit 4
#define RA5                     PORTAbits.RA5                   // bit 5

#define RB4                     PORTBbits.RB4                   // bit 4
#define RB5                     PORTBbits.RB5                   // bit 5
#define RB6                     PORTBbits.RB6                   // bit 6
#define RB7                     PORTBbits.RB7                   // bit 7

#define RC0                     PORTCbits.RC0                   // bit 0
#define RC1                     PORTCbits.RC1                   // bit 1
#define RC2                     PORTCbits.RC2                   // bit 2
#define RC3                     PORTCbits.RC3                   // bit 3
#define RC4                     PORTCbits.RC4                   // bit 4
#define RC5                     PORTCbits.RC5                   // bit 5
#define RC6                     PORTCbits.RC6                   // bit 6
#define RC7                     PORTCbits.RC7                   // bit 7

#define PER0                    PWMCLKbits.PER0                 // bit 0
#define PER1                    PWMCLKbits.PER1                 // bit 1
#define PER2                    PWMCLKbits.PER2                 // bit 2
#define PER3                    PWMCLKbits.PER3                 // bit 3
#define PER4                    PWMCLKbits.PER4                 // bit 4
#define PWMP0                   PWMCLKbits.PWMP0                // bit 5
#define PWMP1                   PWMCLKbits.PWMP1                // bit 6
#define PWMASE                  PWMCLKbits.PWMASE               // bit 7

#define PH1EN                   PWMCON0bits.PH1EN               // bit 0
#define PH2EN                   PWMCON0bits.PH2EN               // bit 1
#define SYNC0                   PWMCON0bits.SYNC0               // bit 2
#define SYNC1                   PWMCON0bits.SYNC1               // bit 3
#define BLANK1                  PWMCON0bits.BLANK1              // bit 4
#define BLANK2                  PWMCON0bits.BLANK2              // bit 5
#define PASEN                   PWMCON0bits.PASEN               // bit 6
#define PRSEN                   PWMCON0bits.PRSEN               // bit 7

#define CMDLY0                  PWMCON1bits.CMDLY0              // bit 0
#define CMDLY1                  PWMCON1bits.CMDLY1              // bit 1
#define CMDLY2                  PWMCON1bits.CMDLY2              // bit 2
#define CMDLY3                  PWMCON1bits.CMDLY3              // bit 3
#define CMDLY4                  PWMCON1bits.CMDLY4              // bit 4
#define COMOD0                  PWMCON1bits.COMOD0              // bit 5
#define COMOD1                  PWMCON1bits.COMOD1              // bit 6
#define OVRLP                   PWMCON1bits.OVRLP               // bit 7

#define PH0                     PWMPH1bits.PH0                  // bit 0
#define PH1                     PWMPH1bits.PH1                  // bit 1
#define PH2                     PWMPH1bits.PH2                  // bit 2
#define PH3                     PWMPH1bits.PH3                  // bit 3
#define PH4                     PWMPH1bits.PH4                  // bit 4
#define C1EN                    PWMPH1bits.C1EN                 // bit 5
#define C2EN                    PWMPH1bits.C2EN                 // bit 6
#define POL                     PWMPH1bits.POL                  // bit 7

#define CVROE                   REFCONbits.CVROE                // bit 1
#define VROE                    REFCONbits.VROE                 // bit 2
#define VREN                    REFCONbits.VREN                 // bit 3
#define VRBB                    REFCONbits.VRBB                 // bit 4
#define BGST                    REFCONbits.BGST                 // bit 5

